///////////////////////////////////////////////////////////////////
//
// Disease Monitor
//
// Module που παρέχει στατιστικά για την εξέλιξη μιας ασθένειας.
//
///////////////////////////////////////////////////////////////////

#pragma once // #include το πολύ μία φορά

#include "ADTMap.h"
#include "ADTList.h"

// Απλά για πιο ευανάγνωστο κώδικα
typedef char* String;

// Οι ημερομηνίες δίνονται σαν Strings, σε format YYYY-MM-DD, πχ "2019-10-31"
typedef String Date;

// O monitor αποθηκεύει εγγραφές του παρακάτω τύπου
// _Ολα_ τα πεδία πρέπει να _υπαχουν_ και να _μην είναι NULL_

struct record {
	int id;				// Μοναδικο id της εγγραφής
	String name;		// Ονομα
	String disease;		// Ασθένεια
	String country;		// Χώρα
	Date date;			// Ημερομηνία, σε μορφή YYYY-DD-MM
};
typedef struct record* Record;


// Αρχικοποιει όλες τις δομές του monitor, πρέπει να κληθεί πριν από οποιαδήποτε άλλη κλήση.
// Αν υπήρχαν ήδη δεδομένα τα διαγράφει καλώντας την dm_destroy.

void dm_init();

// Καταστρέφει όλες τις δομές του monitor, απελευθερώνοντας την αντίστοιχη μνήμη. ΔΕΝ απελευθερώνει
// τα record structs, αυτά δημιουργούνται και καταστρέφονται από τον χρήστη.

void dm_destroy();


// Προσθέτει την εγγραφή record στο monitor. Δεν δεσμεύει νέα μνήμη (ούτε φτιάχνει αντίγραφα του record),
// απλά αποθηκεύει τον pointer (η δέσμευση μνήμης για τα records είναι ευθύνη του χρήστη).
// Αν υπάρχει εγγραφή με το ίδιο id αντικαθιστάται και επιστρέφεται true, αν όχι επιστρέφεται false.

bool dm_insert_record(Record record);

// Αφαιρεί την εγγραφή με το συγκεκριμένο id από το σύστημα (χωρίς free, είναι ευθύνη του χρήστη).
// Επιστρέφει true αν υπήρχε τέτοια εγγραφή, αλλιώς false.

bool dm_remove_record(int id);


// Monitor queries
//
// Στις παρακάτω συναρτήσεις χρησιμοποιούνται τα παρακάτω κριτήρια αναζήτησης εγγραφών:
//   disease:   Μόνο εγγραφές με τη συγκεκριμένη ασθένεια (όλες, αν NULL)
//   country:   Μόνο εγγραφές με τη συγκεκριμένη χώρα (όλες, αν NULL)
//   date_from: Μόνο εγγραφές με ημερομηνία date_from ή μεταγενέστερη (όλες, αν NULL)
//   date_to:   Μόνο εγγραφές με ημερομηνία date_to ή προγενέστερη (όλες, αν NULL)
//
// Οποιοδήποτε από τα κριτήρια μπορεί να είναι NULL, το οποίο σημαίνει "όλες οι εγγραφές"
// (χωρίς φίλτρο για το συγκεκριμένο πεδίο).
//
// Στις συναρτήσεις που επιστρέφουν λίστα, η λίστα _δεν_ έχει destroy handler.
// Ο χρήστης πρέπει να καλέσει ο ίδιος την list_destroy, η οποία θα ελευθερώσει
// μόνο τη λίστα, όχι τα δεδομένα.

// Επιστρέφει λίστα με τα Records που ικανοποιούν τα συγκεκριμένα κριτήρια, σε
// οποιαδήποτε σειρά.

List dm_get_records(String disease, String country, Date date_from, Date date_to);

// Επιστρέφει τον αριθμό εγργαφών που ικανοποιούν τα συγκεκριμένα κριτήρια.

int dm_count_records(String disease, String country, Date date_from, Date date_to);

// Επιστρέφει τις k ασθένειες με τις περισσότερες εγγραφές που ικανοποιούν τα κριτήρια,
// _ταξινομημένες_ με βάση τον αριθμό εγγραφών (πρώτα η ασθένεια με τις περισσότερες).
// Πχ η dm_top_diseases(3, "Germany") επιστρέφει τις 3 ασθένειες με τις περισσοτερες
// εγγραφές στη Γερμανία.
// Επιστρέφονται _μόνο_ ασθένειες με _τουλάχιστον 1_ εγγραφή (που ικανοποιεί τα κριτήρια).

List dm_top_diseases(int k, String country);

